--save picoville!

-- introgfx="⁶-b⁶x8⁶y8²c  ᶜ7⁶.\0\0\0\0\0\0ユ◝²c⁶.\0\0\0\0\0\0¹゜⁸⁶-#ᶜd⁶.\0\0\0ららららら²c⁶.\0\0█◝◝◝◝◝⁶.\0\0◝◝◝◝◝◝²c⁶.\0\0³¹¹¹¹¹⁸⁶-#ᶜe⁶.\0\0\0⁶ᵉ゛>~²cᶜ7⁶.\0\0\0\0\0`ュ◝⁶.\0\0█`\0゜゜ᶠ    ⁶.\0\0\0\0\0\0⁴⬅️²c⁶.\0\0\0\0\0\0¹¹⁸⁶-#ᶜd⁶.\0\0\0ユ8<|~⁸⁶-#ᶜe⁶.\0\0\0\0らら██²cᶜd⁶.\0\0\0◝\0\0\0\0⁸⁶-#ᶜe⁶.\0\0\0\0◝◝◝◝\n²cᶜ7⁶.\0\0\0\0(\0█ら⁸⁶-#ᶜd⁶.\0\0\0\0\0\0○?²cᶜ7⁶.らナナら█\0¹³⁶.ト⁷⁷⁷゜<ユ█²c⁶.○ュユ\0\0\0\0³⁸⁶-#ᶜd⁶.█\0\0ナナナナユ²7⁶.◝エ♥7ssqq⁶.◝◝ワを●ᵉ、、ᶜe⁶.ヨaaれれんエエ²7ᶜc⁶.らナヲᶜ\0ユユヌ⁸⁶-#ᶜe⁶.\0\0\0¹¹¹¹¹²7ᶜc⁶.◝◝◝◜◝◝◆\0⁶.◝◝◝◝◝◝○?⁶.◝◝◝◝◝ンヲュ⁶.◝エ◝◝ャンョョ⁶.◝◝◜ュ◝リネん²7⁶.\0C⁷ᶠ◝◝◝◝⁸⁶-#ᶜd⁶.\0██\0\0\0\0\0²7⁶.○○◝ョ◝ヤ◝ト⁸⁶-#ᶜe⁶.██\0\0\0\0\0\0²d⁶.◝◝◝◝◝◜◜◜\n²dᶜ7⁶.█\0\0\0\0\0\0\0⁸⁶-#ᶜe⁶.@ナナナナユユユ²7ᶜc⁶.ュウ⁶⁴⁴ᶜ<◜⁸⁶-#ᶜe⁶.\0¹¹³³³³¹²7ᶜc⁶.◝◝ヲ\0\0\0\0³ᶜd⁶.ユユナナナナユヲ⁶.ヨ\0¹ナナナナナ²7⁶.「0pqss{○⁸⁶-#ᶜe⁶.\0\0\0\0\0███²7⁶.🅾️🅾️ろナヲ◝◝◝²7ᶜc⁶.⁶ᵉ◜◜◜ウ🅾️😐⁸⁶-#ᶜe⁶.¹¹¹¹¹¹¹\0²7ᶜc⁶.█ナ◝◝◝ンンン⁶.゜かか、<|ュヲ⁶.ワリy8>うっネ²c ²cᶜ3⁶.\0\0\0\0\0\0\0p⁸⁶-#ᶜ4⁶.\0\0らナナユユ😐⁸⁶-#ᶜ7⁶.0`\0\0\0\0\0\0²cᶜ4⁶.\0◝ュヲq³³\r⁸⁶-#ᶜ7⁶.\0\0³⁷ᵉ、<█²cᶜ4⁶.\0⁷³¹\0\0\0\0⁸⁶-#ᶜ7⁶.@@\0`0\0⁷³⁸⁶-#ᶜd⁶.ゆまュおウュヲュ²dᶜe⁶.◜ュュュュヲヲヲ\n²dᶜ7⁶.\0█らららららユ⁸⁶-#ᶜe⁶.ユp8888<ᶜ²dᶜ7⁶.\0゜◝◝ネ¹¹¹⁸⁶-#ᶜc⁶.◜ナ\0\0、²\0\0⁸⁶-#ᶜe⁶.¹\0\0\0\0\0\0\0²dᶜ7⁶.\0\0¹ᶠ゜゜゛「⁸⁶-#ᶜc⁶.◝◝◜ユナナ██²dᶜ7⁶.\0\0\0⁶⁷♥んん⁸⁶-#ᶜc⁶.⁷⁷⁷¹\0\0\0\0²dᶜ7⁶.ᶜ\0\0\0ᵉ◝◝リ²d⁶.\0\0\0\0|◜モを⁸⁶-#ᶜe⁶.█████\0\0\0²7⁶.◝ンヨり⬇️ᶠ゜>²7ᶜc⁶.▤▤▮00022⁸⁶-#ᶜe⁶.\0\0¹¹¹¹¹\0²7ᶜc⁶.ンンヨヨリリリc⁶.ヲ9■⬇️◝◝ンヲ²4⁶.◝◝○?゜ᶠᶠᶠ²4ᶜ3⁶.\0\0\0008⁸0\0\0⁸⁶-#ᶜ6⁶.\0\0\0ら@ら\0\0⁸⁶-#ᶜa⁶.\0\0\0\0000\0\0\0⁸⁶-#ᶜc⁶.◝◝\0\0\0\0\0\0⁸⁶-#ᶜd⁶.\0\0\0\0\0\0\0@²4ᶜ3⁶.Pオ@\0\0\0\0\0⁸⁶-#ᶜ6⁶.ᶜ\n:?.'3゛⁸⁶-#ᶜa⁶.  \0\0\0\0\0\0⁸⁶-#ᶜc⁶.¹\0\0\0\0\0\0\0⁸⁶-#ᶜd⁶.\0\0██████²4ᶜc⁶.ヨ\n8█らナ█♥⁸⁶-#ᶜd⁶.\0\0¹、⁶⁙?「²c⁶.ュヲヲヲヲユユユ²dᶜe⁶.ユユユユナナ◜◜\n²dᶜ7⁶.ユユユユユヲxx⁸⁶-#ᶜe⁶.ᶜᶜᵉᵉᵉ⁷⁷⁷²dᶜ7⁶.¹c◝◝◜\0\0\0²d⁶.う◆◆◆♥ららら⁸⁶-#ᶜc⁶.\0\0\0@@\0\0\0²dᶜ7⁶.フフフフフフネネ⁶.ネ³¹¹¹¹¹³²d⁶.ウ🅾️🅾️ᵉᶜᶜ<8⁸⁶-#ᶜe⁶.\0@@ららららら²7⁶.>|xヲンヲヲュ²7ᶜc⁶.\"ノノナナ◜◜◜⁸⁶-#ᶜe⁶.\0\0\0\0\0¹¹¹²7ᶜc⁶.³⁷◝◝◝◝³³⁸⁶-#ᶜd⁶.\0\0\0\0\0\0ュュ²7ᶜc⁶.ヲ◝◝◝◝◝\0\0⁸⁶-#ᶜd⁶.\0\0\0\0\0\0◝◝²4ᶜc⁶.ᶠᶠᶠ゜゜゜>ゆ⁸⁶-#ᶜd⁶.\0\0\0\0\0\0¹¹²4ᶜc⁶.²⁶ᶠᶠ⁷⁷ᶠᶠ⁸⁶-#ᶜd⁶.ユナ█0ユナ\0ユ²4ᶜc⁶.\0\0▮0x☉⁸\0⁸⁶-#ᶜd⁶.█れヤウ♥wワ◝²4ᶜc⁶.らら●う▤😐●🐱⁸⁶-#ᶜd⁶.⁷?ycgsy}²c⁶.ヲュ◜◜◜◜ュュ²dᶜe⁶.◜◜◜ュュュュヲ\n²dᶜ7⁶.xxユユp█ら@⁸⁶-#ᶜc⁶.\0\0\0\0\0 ▮▮⁸⁶-#ᶜe⁶.⁷⁷ᶠᶠᶠ゜ᶠᶠ²dᶜ7⁶.\0\0\0\0\0¹¹\0²dᶜ4⁶.\0\0\0\0\0\0\0◜⁸⁶-#ᶜ7⁶.█████\0\0\0⁸⁶-#ᶜc⁶.@@@``ナナ\0²dᶜ4⁶.\0\0\0\0\0\0\0⁷⁸⁶-#ᶜ7⁶.れ♥⁷⁷⁷\0\0\0²d⁶.ヤ◝◝◜ヲ\0\0\0²d⁶.ヨニ¹¹\0\0\0\0⁸⁶-#ᶜe⁶.\0\0ナナナナナナ²7⁶.ュ◜◝◝◝◝◝◝²cᶜd⁶.\0\0\0ユユユユユ⁸⁶-#ᶜe⁶.¹¹¹¹¹¹¹¹²cᶜd⁶.ュ◜◜◝◝◝◝◝²d ᶜc⁶.ュュヲ\0\0\0\0\0²dᶜ4⁶.\0\0\0\0\0\0██⁸⁶-#ᶜc⁶.エᶠᶠ゛゛゛、、²dᶜ4⁶.\0\0\0\0\0¹³◝⁸⁶-#ᶜc⁶.゜¥9`\0\0\0\0²dᶜ4⁶.\0\0\0\0\0█ナ◝⁸⁶-#ᶜc⁶.●ᶜ「\0\0\0\0\0²dᶜ4⁶.\0\0\0\0\0³⁷゜⁸⁶-#ᶜc⁶.³³³³⁷⁴\0\0²dᶜe⁶.ヲヲヲユユユユナ\n²dᶜ1⁶.\0\0\0\0\0¹³⁷⁸⁶-#ᶜ4⁶.\0\0`ヲ◝|「\0⁸⁶-#ᶜ5⁶.\0\0\0\0\0█ナユ⁸⁶-#ᶜc⁶.▮▮▮\0\0\0\0\0⁸⁶-#ᶜe⁶.ᶠᶠᶠ⁷\0²⁴\0²dᶜ4⁶.ユヲ?/c@ら█⁸⁶-#ᶜ5⁶.\0\0らオうよ?○⁸⁶-#ᶜ7⁶.²\0\0\0\0\0\0\0²4ᶜ5⁶.\0\0◝◝◝◝◝◜²4⁶.\0\0\0ᶠエエエト⁸⁶-#ᶜd⁶.ユ\0\0\0\0\0\0\0²4ᶜ5⁶.\0\0\0\0\0゜○◝⁸⁶-#ᶜd⁶.ヨナ█\0\0\0\0\0²4ᶜ3⁶.\0\0\0\0\0\0らナ⁸⁶-#ᶜ5⁶.\0\0\0\0\0ら ■⁸⁶-#ᶜd⁶.゜゜ᶠᶠ\0\0\0\0⁸⁶-#ᶜe⁶.ナナユユ\0\0\0\0²4ᶜ3⁶.\0\0\0\0\0\0³ᶠ⁸⁶-#ᶜ5⁶.\0\0\0\0█ん|0⁸⁶-#ᶜ6⁶.\0\0\0\0\0\0█ら⁸⁶-#ᶜd⁶.███\0\0\0\0\0⁸⁶-#ᶜe⁶.○○○゜ᶠ\0\0\0²4ᶜ5⁶.\0\0\0\0◝\0\0003⁸⁶-#ᶜ6⁶.\0\0\0\0\0◝◝ア⁸⁶-#ᶜc⁶.ᶠᶠᶠ\0\0\0\0\0⁸⁶-#ᶜd⁶.ユユユ\0\0\0\0\0²4ᶜ3⁶.\0\0\0\0\0\0█ら⁸⁶-#ᶜ5⁶.\0\0\0\0³をl;⁸⁶-#ᶜ6⁶.\0\0\0\0\0¹³⁴⁸⁶-#ᶜd⁶.◝◝◝ヲナ\0\0\0²4ᶜ3⁶.\0\0\0\0\0⁶゜゜⁸⁶-#ᶜ5⁶.\0\0\0\0ᵉ9 `⁸⁶-#ᶜd⁶.◝◝◝れ\0\0\0\0²4⁶.◝◝◝○ᶠ\0\0\0²4ᶜ5⁶.\0\0\0█ナヲュ◝⁸⁶-#ᶜc⁶.、、⁴\0\0\0\0\0⁸⁶-#ᶜd⁶.c#³\0\0\0\0\0²4ᶜ5⁶.\0\0ヲンンョョョ⁶.\0█◝◝◝◝◝◝⁶.\0ᶜュュュュュョ²4ᶜ1⁶.\0\0\0█らナユま⁸⁶-#ᶜ5⁶.\0\0ᶠ○?゜ᶠG⁸⁶-#ᶜd⁶.「\0\0\0\0\0\0\0⁸⁶-#ᶜe⁶.ナ\0\0\0\0\0\0\0\n²1ᶜ5⁶.ヨニり¹\0\0\0\0⁸⁶-#ᶜc⁶.\0\0\0\0¹¹¹¹⁸⁶-#ᶜd⁶.⁸▮ ら█▮00²1ᶜ5⁶.◝◝◝ユ█\0\0\0⁸⁶-#ᶜd⁶.\0\0\0ᶠ○◝◝◜²4ᶜ5⁶.◜ュョやツイっ☉⁸⁶-#ᶜ6⁶.\0\0\0\0 ▮▮0⁸⁶-#ᶜ7⁶.\0\0\0@\0  @⁸⁶-#ᶜd⁶.\0\0\0\0\0\0⁷⁷²4ᶜ5⁶.かかよよ?○○g⁸⁶-#ᶜ6⁶.\0\0\0\0\0\0\0「²5ᶜa⁶.\0\0\0\0\0\0\0█⁸⁶-#ᶜb⁶.\0\0\0\0\0\0\0@²5ᶜ3⁶.` 00``@\0⁸⁶-#ᶜ4⁶.\0▮\0\0\0\0\0\0⁸⁶-#ᶜ7⁶.█ら@ら█\0\0\0⁸⁶-#ᶜa⁶.\0\0█\0\0\0\0²⁸⁶-#ᶜb⁶.\0\0\0\0\0\0ᶠ。²5ᶜ3⁶.、\0\0\0\0\0\0\0⁸⁶-#ᶜ6⁶.ららユ⁸⁶⁙#¹⁸⁶-#ᶜ7⁶.³ᶠ⁶\0\0(@B⁸⁶-#ᶜa⁶.\0\0¹¹\0\0\0\0²5ᶜ6⁶.MIH\0Aj>☉⁸⁶-#ᶜ7⁶.\0\0\0\0>⁘\0\0²5ᶜ3⁶.ナ@\0\0\0\0\0\0⁸⁶-#ᶜ6⁶.⁶゛ᶠ▮⁴H\0█⁸⁶-#ᶜ7⁶.\0█ら\0008$るA⁸⁶-#ᶜ9⁶.\0\0\0\0\0\0\0⁸⁸⁶-#ᶜa⁶.\0\0\0█\0\0\0\0²5ᶜ3⁶.800▮▮「、「⁸⁶-#ᶜ7⁶.⁷ᶠᶠᶜᵉ⁶¹³⁸⁶-#ᶜa⁶.\0\0\0³り\0██⁸⁶-#ᶜb⁶.\0\0\0█\0ら@@²5ᶜa⁶.\0\0\0\0³ᶠᵇᶜ⁸⁶-#ᶜb⁶.\0\0\0¹⁴\0⁘▮²5 ᶜ4⁶.⁶⁴⁴⁴⁴⁴⁴ᶜᶜd⁶.\0\0\0\0\0\0ユ◜²5ᶜ1⁶.\0\0\0█らpx|⁸⁶-#ᶜ4⁶.²²³¹¹¹¹\0⁸⁶-#ᶜd⁶.\0\0\0\0\0██⬇️²5ᶜ1⁶.うおかかおおおお⁸⁶-#ᶜd⁶.\0\0``aaaa\n²1ᶜc⁶.¹¹¹¹¹\0\0\0⁸⁶-#ᶜd⁶.00000100²1⁶.ュンヨヨニゃ웃)²5ᶜ6⁶.ユナらユxまP█⁸⁶-#ᶜc⁶.\0⁸⁸\0\0\0⁴ᶜ⁸⁶-#ᶜd⁶.⁷⁷⁷⁷³³³³²5ᶜ6⁶.?\"すに8▶⬆️⁶⁸⁶-#ᶜd⁶.\0\0\0\0\0\0\0`²5ᶜ4⁶.¹¹\0\0\0\0\0\0⁸⁶-#ᶜ6⁶.\0\0\0゜<0Aᶠ⁸⁶-#ᶜ7⁶.\0\0ᶠ\0\0\0\0\0⁸⁶-#ᶜa⁶.@████\0\0\0⁸⁶-#ᶜb⁶.き``@\0█\0\0²5ᶜ6⁶.█ら` ⁸⁸⁸\0⁸⁶-#ᶜ7⁶.\0\0█@0▮\0\0⁸⁶-#ᶜ9⁶.\0\0\0\0\0███⁸⁶-#ᶜa⁶.¹¹¹\0¹¹\0\0⁸⁶-#ᶜb⁶.゛゛ᵉ⁷²²³³²5ᶜ6⁶.¹\0\0\0\0\0\0\0⁸⁶-#ᶜ7⁶.█¹\0\0\0\0\0\0⁸⁶-#ᶜ9⁶.「8<おサOok⁸⁶-#ᶜa⁶.\0\0@`(ぬ…⬆️²5ᶜ6⁶.▒~\0\0\0\0\0\0⁸⁶-#ᶜ7⁶.\0▒~\0\0\0\0\0⁸⁶-#ᶜ9⁶.\0\0\0▒⬇️¹¹¹⁸⁶-#ᶜa⁶.\0\0\0\0|◜◜◜²5ᶜ6⁶.¹\0\0\0\0\0\0\0⁸⁶-#ᶜ7⁶.█\0\0\0\0\0\0\0⁸⁶-#ᶜ9⁶.、6><レメミフ⁸⁶-#ᶜa⁶.\0⁸¹³\n□⁘「²5ᶜ6⁶.\0⁸\0▮\0\0\0\0⁸⁶-#ᶜ7⁶.³⁷ᵉᶜ、▮▮\0⁸⁶-#ᶜ9⁶.\0\0\0\0\0¹¹¹⁸⁶-#ᶜa⁶.@\0\0\0\0\0\0\0⁸⁶-#ᶜb⁶.き``@@@@@²5ᶜ6⁶.\0²⁵  ▶\n%S⁸⁶-#ᶜ7⁶.\0\0²⁶⁸0@\0⁸⁶-#ᶜa⁶.⁸⁸\0\0\0\0\0\0⁸⁶-#ᶜb⁶.▮▮▮\0\0\0\0\0²5ᶜ6⁶.\0\0\0\0ナ█\0\0⁸⁶-#ᶜ7⁶.\0\0\0\0\0@██⁸⁶-#ᶜc⁶.\0\0000「⁸▮00⁸⁶-#ᶜd⁶.\0\0ら\0⁴ᵉᵉᵉ²5ᶜ4⁶.⁸「▮▮\0\0\0\0⁸⁶-#ᶜ6⁶.\0\0\0\0\0¹¹¹⁸⁶-#ᶜd⁶.\0█りフ◜ュュュ²1⁶.◝◝○?か◆❎⧗²1ᶜc⁶.\0⁸⁸⁸⁸\0\0\0⁸⁶-#ᶜd⁶.▒░░░░😐😐ᶜ²1⁶.aaa¹¹¹\0\0\n⁶. \0\0\0\0\0\0\0⁶.)たたそそき██²1ᶜ5⁶.   ききき …⁸⁶-#ᶜ6⁶.ららら@@@ら`⁸⁶-#ᶜc⁶.ᶜᶜᶜ\0²²²²⁸⁶-#ᶜd⁶.⁙□▮「▮▮▮\0²5ᶜ6⁶.⁶⁶⁶⁶ᵉᵉᵉ゛⁸⁶-#ᶜd⁶.ユユユユナナナら²5ᶜ6⁶.0`\0\0\0\0\0\0⁸⁶-#ᶜa⁶.\0\0\0\0▮▮  ⁸⁶-#ᶜb⁶.\0⁸「0  ▮@⁸⁶-#ᶜd⁶.\0³³⁷⁷⁷⁷ᶠ²5ᶜ6⁶.\0\0\0@██\0\0⁸⁶-#ᶜ9⁶.█\0\0\0\0\0\0\0⁸⁶-#ᶜa⁶.²\0²²²²2 ⁸⁶-#ᶜb⁶.⁴⁶ᶜᶜ、<ᶜ_²5ᶜ6⁶.\0\0\0\0\0¹⬇️⁷⁸⁶-#ᶜ7⁶.\0\0\0\0\0\0\0█⁸⁶-#ᶜ9⁶.◝トい>ム|80⁸⁶-#ᶜa⁶.\0 dら▮\0\0\0²5ᶜ6⁶.\0\0\0\0\0¹ュ◝⁸⁶-#ᶜ7⁶.\0\0\0\0\0◜³\0⁸⁶-#ᶜ9⁶.▒を|?\0\0\0\0⁸⁶-#ᶜa⁶.~9⬇️ら\0\0\0\0²5ᶜ6⁶.\0\0\0\0\0▒🐱A⁸⁶-#ᶜ7⁶.\0\0\0\0\0\0¹²⁸⁶-#ᶜ9⁶.レひ~w~<8「⁸⁶-#ᶜa⁶.\nK¹⁸\0\0\0\0²5ᶜ6⁶.\0\0²¹¹²\0¹⁸⁶-#ᶜ7⁶.\0\0\0\0⁴\0²²⁸⁶-#ᶜa⁶.@```pユヲx⁸⁶-#ᶜb⁶. \0\0\0█\0\0█²5ᶜ6⁶.ヒアスpきらら█⁸⁶-#ᶜ7⁶.\0\0\0\0\0\0\0@⁸⁶-#ᶜb⁶.\0\0\0\0\0▮▮」²5ᶜ6⁶.\0▒ュセ⁙フ³{⁸⁶-#ᶜ7⁶.█@\0\0⁸「\0\0⁸⁶-#ᶜc⁶.▮\0\0\0\0\0\0\0⁸⁶-#ᶜd⁶.ᵉ\0\0\0\0\0\0\0²5ᶜ1⁶.\0\0██らららナ⁸⁶-#ᶜ6⁶.¹¹¹³⁶⁴⁷⁴⁸⁶-#ᶜd⁶.ュュxp000▮²1⁶.ˇ⬆️ˇˇ‖‖⁵¹⁶.ᶜᶜ⁴\0\0\0\0\0 \n ᶜ5⁶.\0\0\0█████²1⁶.オ,かz⁘ヲ((⁸⁶-#ᶜ6⁶. オ`░⁸⁷んん⁸⁶-#ᶜ7⁶.\0\0\0¹ネ\0\0\0⁸⁶-#ᶜc⁶.²\0\0\0\0\0\0\0²1ᶜ5⁶.0h✽Fひᵇ⁘T⁸⁶-#ᶜ6⁶.ᶠ▶zみKルヌく⁸⁶-#ᶜ7⁶.\0\0\0\0\0\0¹²⁸⁶-#ᶜd⁶.ら█\0\0\0\0\0\0²1ᶜ5⁶.▮ @A▒▒¹¹⁸⁶-#ᶜa⁶.@ら██\0\0\0\0⁸⁶-#ᶜb⁶.き\0\0\0\0\0\0\0⁸⁶-#ᶜd⁶.ᶠ゜?>~~◜\0²1ᶜ5⁶.🐱⁴⁴⁸8ヨ◜\0⁸⁶-#ᶜa⁶. \0@ニれ⁶\0\0⁸⁶-#ᶜb⁶.]ャめ◀⁴⁸\0\0⁸⁶-#ᶜd⁶.\0\0\0\0\0\0¹\0²5ᶜ6⁶.んヒt4ま|あb⁸⁶-#ᶜ7⁶.\0\0\0\0\0█d、⁸⁶-#ᶜb⁶.\0\0\0¹\0\0\0\0²5ᶜ6⁶.◝¹\0◜◝\0◝\0⁸⁶-#ᶜ7⁶.\0\0\0\0\0◝\0\0²5ᶜ1⁶.\0\0\0\0\0\0\0█⁸⁶-#ᶜ6⁶.CヤチX7~YH⁸⁶-#ᶜ7⁶.⁴\0\0█\0¹&4²5ᶜ1⁶.\0\0\0\0\0\0\0◝⁸⁶-#ᶜ7⁶.¹¹¹\0\0\0\0\0⁸⁶-#ᶜa⁶.8░░F\"ᶜ\0\0⁸⁶-#ᶜb⁶.ろxx8、\0\0\0⁸⁶-#ᶜd⁶.\0\0\0\0\0\0█\0²5ᶜ1⁶.\0\0\0\0\0\0\0◝⁸⁶-#ᶜ6⁶.@\0\0\0\0\0\0\0⁸⁶-#ᶜ7⁶.█\0\0\0\0\0\0\0⁸⁶-#ᶜa⁶.\0⁸\0\0\0\0\0\0⁸⁶-#ᶜb⁶.゜⁷⁶²¹¹\0\0⁸⁶-#ᶜd⁶.\0\0ナナヲヲュ\0²5ᶜ6⁶.✽Lテアアウモd⁸⁶-#ᶜ7⁶.\0\0\0\0\0\0\0🐱⁸⁶-#ᶜd⁶.\0\0\0¹¹\0\0\0²5ᶜ1⁶.ナナナナナナナ◜⁸⁶-#ᶜ6⁶.⁷²³¹¹\0\0¹⁸⁶-#ᶜ7⁶.\0\0\0\0\0¹¹\0⁸⁶-#ᶜd⁶.▮「「、、、、\0²1   \n ²1ᶜ5⁶.██████\0\0⁸⁶-#ᶜd⁶.\0\0\0\0\0\0\0 ²1ᶜ5⁶.*ち((Dれ\0\0⁸⁶-#ᶜ6⁶.わEんん⬇️\0\0\0⁸⁶-#ᶜd⁶.\0\0\0\0\0\0\0ᶜ²1ᶜ5⁶.T‖%$る³\0\0⁸⁶-#ᶜ6⁶.くヌるれ¹\0\0\0⁸⁶-#ᶜ7⁶.²\0\0\0\0\0\0\0⁸⁶-#ᶜd⁶.\0\0\0\0\0ろュ◜²1ᶜ5⁶.¹¹¹¹\0\0\0\0⁸⁶-#ᶜd⁶.>~◜◜\0⁷?◝²1⁶.\0\0¹⁷\0\0\0¹²1ᶜ5⁶.#、\0\0\0\0\0\0⁸⁶-#ᶜ6⁶.、\0\0\0\0\0\0\0²1ᶜd⁶.\0\0\0\0\0\0らユ²1ᶜ5⁶.D8\0\0\0\0\0\0⁸⁶-#ᶜ6⁶.0\0\0\0\0\0\0\0⁸⁶-#ᶜ7⁶.⁸\0\0\0\0\0\0\0⁸⁶-#ᶜd⁶.\0\0\0\0\0◝◝◝²1ᶜ5⁶.\0\0\0\0\0\0\0█⁸⁶-#ᶜd⁶.\0\0らユ\0?○○²1ᶜ5⁶.\0\0\0█\0\0🅾️ン⁸⁶-#ᶜ6⁶.\0\0\0\0\0\0\0⁶⁸⁶-#ᶜ7⁶.\0\0\0\0██\0\0⁸⁶-#ᶜd⁶.\0\0\0¹\0\0\0\0²5ᶜ6⁶.dv::??0●⁸⁶-#ᶜ7⁶.🐱▒AA@@\0¹²5ᶜ1⁶.█\0\0\0◝\0\0\0⁸⁶-#ᶜ6⁶.\0\0\0\0\0\0\0⁷⁸⁶-#ᶜd⁶.~◜◝◝\0◝ユナ²1⁶.\0\0\0\0\0³³⁷  \n ⁶.ナナ\0◜◜◝◝◝⁶.◝◝\0◝◝◝◝◝⁶.◝◝\0◝◝◝◝◝⁶.◝◝\0◝◝◝◝◝⁶.ᶠ◝\0◝◝◝◝◝⁶.ナ◝\0◝◝◝◝◝⁶.◝◝\0◝◝◝◝◝⁶.◝◝\0◝◝◝◝◝²1ᶜ5⁶.██\0\0████⁸⁶-#ᶜd⁶.○○\0³⁷⁷⁷ᶠ²1ᶜ5⁶.pBEQQH((⁸⁶-#ᶜ6⁶.ᵉ<\n🅾️🅾️♥んん⁸⁶-#ᶜ7⁶.▒▒█\0\0\0\0\0²1ᶜ5⁶.>ムi3のそ($⁸⁶-#ᶜ6⁶.A⁙∧アMGんれ⁸⁶-#ᶜ7⁶.█\0\0\0\0\0\0\0²1ᶜ5⁶.▮▶ᶜ⁸ᵇ\n⁸⁸⁸⁶-#ᶜ6⁶.⁸\0³⁷⁴⁵⁷⁷⁸⁶-#ᶜ7⁶.⁷⁸\0\0\0\0\0\0⁸⁶-#ᶜd⁶.ナナ\0ユユユユユ²1⁶.⁷⁷\0?○○◝◝  \n⁶.\0\0ヲヲヲュュュ⁶.◝\0◝◝◝◝◝◝⁶.◝\0◝◝◝◝◝◝⁶.◝\0◝◝◝◝◝◝⁶.◝\0◝◝◝◝◝◝⁶.◝\0◝◝◝◝◝◝⁶.◝\0◝◝◝◝◝◝⁶.◝\0◝◝◝◝◝◝⁶.◝\0◝◝◝◝◝◝²1ᶜ5⁶.██\0\0\0\0\0\0⁸⁶-#ᶜd⁶.゜\0゜゜◝◝◝◝²1ᶜ5⁶.(-'ら\0\0\0\0⁸⁶-#ᶜ6⁶.⁶\0█\0\0\0\0\0⁸⁶-#ᶜ7⁶.りる@\0\0\0\0\0⁸⁶-#ᶜd⁶.\0\0\0⁶ᶠ◝◝◝²1ᶜ5⁶.$bBCら\0\0\0⁸⁶-#ᶜ6⁶.れ▒▒\0\0\0\0\0⁸⁶-#ᶜ7⁶.\0\0\0█\0\0\0\0⁸⁶-#ᶜd⁶.\0\0⁴⁴ᶠ゜◝◝²1ᶜ5⁶.⁸⁴⁴⁶³\0\0\0⁸⁶-#ᶜ6⁶.⁷³³\0\0\0\0\0⁸⁶-#ᶜ7⁶.\0\0\0¹\0\0\0\0⁸⁶-#ᶜd⁶.ユ\0ヲヲュ◜◝◝²1⁶.◝\0◝◝◝◝◝◝⁶.\0\0○◝◝◝◝◝⁶.\0\0\0\0\0\0\0¹\n⁶.ュュュュ\0◝◝◝⁶.◝◝◝◝\0◝◝◝⁶.◝◝◝◝\0◝◝◝⁶.◝◝◝◝\0◝◝◝⁶.◝◝◝◝\0◝◝◝⁶.◝◝◝◝\0◝◝◝⁶.◝◝◝◝\0◝◝◝⁶.◝◝◝◝\0◝◝◝⁶.◝◝◝◝\0◝◝◝⁶.◝◝◝◝\0◝◝◝⁶.◝◝◝◝\0◝◝◝⁶.◝◝◝◝\0◝◝◝⁶.◝◝◝◝\0◝◝◝⁶.◝◝◝◝\0◝◝◝⁶.◝◝◝◝\0◝◝◝⁶.¹¹¹¹\0??○\n²d               ᶜ1⁶.████\0\0\0\0"
introgfx="⁶-b⁶x8⁶y8   ᶜd⁶.\0\0\0ららららら⁶.\0\0█◝◝◝◝◝⁶.\0\0◝◝◝◝◝◝⁶-#⁶.\0\0³¹¹¹¹¹⁸⁶-#ᶜe⁶.\0\0\0⁶ᵉ゛>~⁶-#       ⁶-#ᶜd⁶.\0\0\0ユ8<|~⁸⁶-#ᶜe⁶.\0\0\0\0らら██⁶-#ᶜd⁶.\0\0\0◝\0\0\0\0⁸⁶-#ᶜe⁶.\0\0\0\0◝◝◝◝\n⁶-#ᶜd⁶.\0\0\0\0\0\0○?⁸⁶-#ᶜe⁶.\0\0\0\0\0\0\0ら⁶-#  ᶜd⁶.ナナナナナナナユ²d  ²e ⁶-#ᶜe⁶.\0¹¹¹¹¹¹¹     ᶜd⁶.\0███\0\0\0\0²dᶜe⁶.██\0\0\0\0\0\0⁶.◝◝◝◝◝◜◜◜\n⁶.らナナナナユユユ⁶-#⁶.\0¹¹³³³³¹ ᶜd⁶.ユユユユユヲヲヲ²d ᶜe⁶.\0\0██████²e ⁶-#⁶.¹¹¹¹¹¹¹¹    ⁶-#ᶜ3⁶.\0\0\0\0\0\0\0p⁸⁶-#ᶜ4⁶.\0\0らナナユユ😐⁶-#⁶.\0◝◝◝○゜³\r⁶-#⁶.\0⁷³¹\0\0\0\0⁸⁶-#ᶜd⁶.◜ヲュ◜◜ュュュ²dᶜe⁶.◜ュュュュヲヲヲ\n⁶.ユユヲヲヲヲュュ⁶-#ᶜd⁶.\0\0\0\0\0ュ◜◜⁸⁶-#ᶜe⁶.¹¹¹\0\0\0\0\0⁶-#ᶜd⁶.\0\0\0\0\0\0○○⁶.ヲヲヲヲュュュュ²d ᶜe⁶.█████ららら²e ⁶-#⁶.¹¹¹¹¹¹¹¹  ᶜ4⁶.\0\0█らナユユユ⁶-#ᶜ3⁶.\0\0\0008⁸0\0\0⁸⁶-#ᶜ4⁶.\0\0◝⁷♥ᶠ◝よ⁸⁶-#ᶜ6⁶.\0\0\0ら@ら\0\0⁸⁶-#ᶜa⁶.\0\0\0\0000\0\0\0⁸⁶-#ᶜd⁶.\0\0\0\0\0\0\0@⁶-#ᶜ3⁶.Pオ@\0\0\0\0\0⁸⁶-#ᶜ4⁶.🐱⁵⁵@QXLa⁸⁶-#ᶜ6⁶.ᶜ\n:?.'3゛⁸⁶-#ᶜa⁶.  \0\0\0\0\0\0⁸⁶-#ᶜd⁶.\0\0██████⁶-#ᶜ4⁶.ᵉレをc9ᶜ@`⁸⁶-#ᶜd⁶.\0\0¹、⁶⁙?「⁸⁶-#ᶜe⁶.\0\0\0\0\0\0\0⁷⁶-#ᶜd⁶.ュヲヲヲヲユユユ²dᶜe⁶.ユユユユナナ◜◜\n⁶-#ᶜd⁶.³³¹¹¹███⁸⁶-#ᶜe⁶.||~~~???⁶-#ᶜd⁶.◜◝◝◝◝◝◝◝⁶.○○○?????⁶.ュュュ◜◜◜◜◜²d ᶜe⁶.らららららららら²e ⁶-#⁶.¹¹¹¹¹¹¹¹ᶜd⁶.\0\0\0\0\0\0ュュ⁶.\0\0\0\0\0\0◝◝⁶-#ᶜ4⁶.ユユユナナナら@⁸⁶-#ᶜd⁶.\0\0\0\0\0\0¹¹⁶-#ᶜ4⁶.\r」pら⁸「ユ\0⁸⁶-#ᶜd⁶.ユナ█0ユナ\0ユ²4⁶.█れヤZ❎c7お⁸⁶-#ᶜe⁶.\0\0▮さhうっa⁶-#ᶜ4⁶.8\0\0\0\0\0\0\0⁸⁶-#ᶜd⁶.⁵?ygOw{u⁸⁶-#ᶜe⁶.²\0⁶「0⁸⁴\n⁶-#ᶜd⁶.ヲュ◜◜◜◜ュュ²dᶜe⁶.◜◜◜ュュュュヲ\n⁶-#ᶜd⁶.██ららららナナ⁸⁶-#ᶜe⁶.?゜゜゜゜゜ᶠᶠ²d ⁶-#ᶜ4⁶.\0\0\0\0\0\0\0◜⁸⁶-#ᶜd⁶.???゜゜゜゜¹⁶-#ᶜ4⁶.\0\0\0\0\0\0\0⁷⁸⁶-#ᶜd⁶.◜◜◝◝◝◝◝ヲ²d ᶜe⁶.ナナナナナナナナ²e ⁶-#ᶜd⁶.\0\0\0ユユユユユ⁸⁶-#ᶜe⁶.¹¹¹¹¹¹¹¹⁶-#ᶜd⁶.ュ◜◜◝◝◝◝◝²d ⁶-#⁶.³³⁷◝◝◝◝◝⁶-#ᶜ4⁶.\0\0\0\0\0\0██⁸⁶-#ᶜd⁶.0ユユニニニcc⁸⁶-#ᶜe⁶.ら\0\0\0\0\0\0\0²4ᶜd⁶.ヘレウかよ◜ュ\0⁸⁶-#ᶜe⁶.▶\n1`@\0\0\0⁶-#ᶜ4⁶.\0\0\0\0\0█ナ◝⁸⁶-#ᶜd⁶.wャフ◝◝○゜\0⁸⁶-#ᶜe⁶.⁸⁴「\0\0\0\0\0⁶-#ᶜ4⁶.\0\0\0\0\0³⁷゜⁸⁶-#ᶜd⁶.ュュュュヲヲヲナ²dᶜe⁶.ヲヲヲユユユユナ\n⁶-#ᶜ1⁶.\0\0\0\0\0¹³⁷⁸⁶-#ᶜ4⁶.\0\0`ヲ◝|「\0⁸⁶-#ᶜ5⁶.\0\0\0\0\0█ナユ⁸⁶-#ᶜd⁶.ナナ█\0\0\0\0⁸⁸⁶-#ᶜe⁶.ᶠᶠᶠ⁷\0²⁴\0²4ᶜ5⁶.\0\0らオうよ?○⁸⁶-#ᶜd⁶.ᶠ⁷\0\0\0\0\0\0²4ᶜ5⁶.\0\0◝◝◝◝◝◜²4⁶.\0\0\0ᶠエエエト⁸⁶-#ᶜd⁶.ユ\0\0\0\0\0\0\0²4ᶜ5⁶.\0\0\0\0\0゜○◝⁸⁶-#ᶜd⁶.ヨナ█\0\0\0\0\0²4ᶜ3⁶.\0\0\0\0\0\0らナ⁸⁶-#ᶜ5⁶.\0\0\0\0\0ら ■⁸⁶-#ᶜd⁶.゜゜ᶠᶠ\0\0\0\0⁸⁶-#ᶜe⁶.ナナユユ\0\0\0\0²4ᶜ3⁶.\0\0\0\0\0\0³ᶠ⁸⁶-#ᶜ5⁶.\0\0\0\0█ん|0⁸⁶-#ᶜ6⁶.\0\0\0\0\0\0█ら⁸⁶-#ᶜd⁶.███\0\0\0\0\0⁸⁶-#ᶜe⁶.○○○゜ᶠ\0\0\0⁶-#ᶜ4⁶.\0\0\0◝\0\0\0\0⁸⁶-#ᶜ5⁶.\0\0\0\0◝\0\0003⁸⁶-#ᶜ6⁶.\0\0\0\0\0◝◝ア⁸⁶-#ᶜd⁶.ユユユ\0\0\0\0\0²3ᶜ4⁶.\0\0\0⁷、8▮\0⁸⁶-#ᶜ5⁶.\0\0\0\0³ろh3⁸⁶-#ᶜ6⁶.\0\0\0\0\0³⁷ᶜ⁸⁶-#ᶜd⁶.◝◝◝ヲナ\0\0\0²3ᶜ4⁶.\0\0\0<ヨらら█⁸⁶-#ᶜ5⁶.\0\0\0\0ᵉ9 `⁸⁶-#ᶜd⁶.◝◝◝れ\0\0\0\0²4⁶.◝◝◝○ᶠ\0\0\0⁶-#ᶜ4⁶.█らヲ○゜⁷³\0⁸⁶-#ᶜ5⁶.\0\0\0█ナヲュ◝⁸⁶-#ᶜd⁶.c#³\0\0\0\0\0²4ᶜ5⁶.\0\0ヲンンョョョ⁶.\0█◝◝◝◝◝◝⁶.\0ᶜュュュュュョ²4ᶜ1⁶.\0\0\0█らナユま⁸⁶-#ᶜ5⁶.\0\0ᶠ○?゜ᶠG⁸⁶-#ᶜd⁶.「\0\0\0\0\0\0\0⁸⁶-#ᶜe⁶.ナ\0\0\0\0\0\0\0\n⁶-#ᶜ1⁶.⁶ᵉ゛>~モウウ⁸⁶-#ᶜ5⁶.ヨニり¹\0\0\0\0⁸⁶-#ᶜd⁶.⁸▮ ら█▮00⁸⁶-#ᶜe⁶.\0\0\0\0¹\0\0\0²1ᶜ5⁶.◝◝◝ユ█\0\0\0⁸⁶-#ᶜd⁶.\0\0\0ᶠ○◝◝◜²4ᶜ5⁶.◜ュョやツイっ☉⁸⁶-#ᶜ6⁶.\0\0\0\0 ▮▮0⁸⁶-#ᶜ7⁶.\0\0\0@\0  @⁸⁶-#ᶜd⁶.\0\0\0\0\0\0⁷⁷²4ᶜ5⁶.かかよよ?○○g⁸⁶-#ᶜ6⁶.\0\0\0\0\0\0\0「²5ᶜa⁶.\0\0\0\0\0\0\0█⁸⁶-#ᶜb⁶.\0\0\0\0\0\0\0@²5ᶜ3⁶.` 00``@\0⁸⁶-#ᶜ4⁶.\0▮\0\0\0\0\0\0⁸⁶-#ᶜ7⁶.█ら@ら█\0\0\0⁸⁶-#ᶜa⁶.\0\0█\0\0\0\0²⁸⁶-#ᶜb⁶.\0\0\0\0\0\0ᶠ。²5ᶜ3⁶.、\0\0\0\0\0\0\0⁸⁶-#ᶜ6⁶.ららユ⁸⁶⁙#¹⁸⁶-#ᶜ7⁶.³ᵉ⁴\0\0(@B⁸⁶-#ᶜa⁶.\0¹³¹\0\0\0\0²5ᶜ6⁶.IKK\0Aj>☉⁸⁶-#ᶜ7⁶.\0\0\0\0>⁘\0\0²5ᶜ3⁶.ナ@\0\0\0\0\0\0⁸⁶-#ᶜ6⁶.ᵉ゜ᶠ▮$H\0█⁸⁶-#ᶜ7⁶.\0█ら\0「$るA⁸⁶-#ᶜ9⁶.\0\0\0\0\0\0\0⁸⁸⁶-#ᶜa⁶.\0\0\0█\0\0\0\0²5ᶜ3⁶.800▮▮「、「⁸⁶-#ᶜ6⁶.\0\0\0\0\0\0¹²⁸⁶-#ᶜ7⁶.⁷ᶠᵉᶜᵉ⁶\0¹⁸⁶-#ᶜa⁶.\0\0¹³り\0██⁸⁶-#ᶜb⁶.\0\0\0█\0ら@@²5ᶜa⁶.\0\0\0\0³ᶠᵇᶜ⁸⁶-#ᶜb⁶.\0\0\0¹⁴\0⁘▮²5 ᶜ4⁶.⁶⁴⁴⁴⁴⁴⁴ᶜᶜd⁶.\0\0\0\0\0\0ユ◜²5ᶜ1⁶.\0\0\0█らpx|⁸⁶-#ᶜ4⁶.²²³¹¹¹¹\0⁸⁶-#ᶜd⁶.\0\0\0\0\0██⬇️²5ᶜ1⁶.うおかかおおおお⁸⁶-#ᶜd⁶.\0\0``aaaa\n⁶-#ᶜ1⁶.ウウウウウウエエ⁸⁶-#ᶜd⁶.00000100²1⁶.ュンヨヨニゃ웃)⁶-#ᶜ5⁶.⁸▮0⁸░Dそp⁸⁶-#ᶜ6⁶.ユナらユxまP█⁸⁶-#ᶜd⁶.⁷⁷⁷⁷³³³³²5ᶜ6⁶.?\"すに8▶⬆️⁶⁸⁶-#ᶜd⁶.\0\0\0\0\0\0\0`²5ᶜ4⁶.¹¹\0\0\0\0\0\0⁸⁶-#ᶜ6⁶.\0\0\0゜<0Aᶠ⁸⁶-#ᶜ7⁶.\0\0ᶠ\0\0\0\0\0⁸⁶-#ᶜa⁶.@████\0\0\0⁸⁶-#ᶜb⁶.き``@\0█\0\0²5ᶜ6⁶.█ら`\0⁸⁸⁸\0⁸⁶-#ᶜ7⁶.\0\0█`0▮\0\0⁸⁶-#ᶜ9⁶.\0\0\0\0\0███⁸⁶-#ᶜa⁶.¹¹¹\0¹¹\0\0⁸⁶-#ᶜb⁶.゛゛ᵉ⁷²²³³²5ᶜ6⁶.¹\0\0\0\0\0\0\0⁸⁶-#ᶜ7⁶.█¹\0\0\0\0\0\0⁸⁶-#ᶜ9⁶.「8|なサ_ok⁸⁶-#ᶜa⁶.\0\0\0P(き…⬆️²5ᶜ6⁶.▒~\0\0\0\0\0\0⁸⁶-#ᶜ7⁶.\0▒~\0\0\0\0\0⁸⁶-#ᶜ9⁶.\0\0\0▒🐱¹¹¹⁸⁶-#ᶜa⁶.\0\0\0\0}◜◜◜²5ᶜ6⁶.¹\0\0\0\0\0\0\0⁸⁶-#ᶜ7⁶.█\0\0\0\0\0\0\0⁸⁶-#ᶜ9⁶.、6/>レメミミ⁸⁶-#ᶜa⁶.\0⁸▮¹\n□⁘⁘²5ᶜ6⁶.\0ᶜ⁸▮\0⁸\0\0⁸⁶-#ᶜ7⁶.³³⁶ᶜ、▮▮\0⁸⁶-#ᶜ9⁶.\0\0\0\0\0¹¹¹⁸⁶-#ᶜa⁶.@\0\0\0\0\0\0\0⁸⁶-#ᶜb⁶.き``@@@@@²5ᶜ6⁶.\0²⁵ ▶\n%S⁸⁶-#ᶜ7⁶.\0\0²⁶⁸0@\0⁸⁶-#ᶜa⁶.⁸⁸\0\0\0\0\0\0⁸⁶-#ᶜb⁶.▮▮▮\0\0\0\0\0⁶-#ᶜ5⁶.◝◝ᶠフ⁙!AA⁸⁶-#ᶜ6⁶.\0\0\0\0ナ█\0\0⁸⁶-#ᶜ7⁶.\0\0\0\0\0@██⁸⁶-#ᶜd⁶.\0\0ら\0⁴ᵉᵉᵉ²4ᶜ5⁶.ワg.⁸¹²²²⁸⁶-#ᶜ6⁶.\0\0\0\0\0¹¹¹⁸⁶-#ᶜd⁶.\0█りフ◜ュュュ²1⁶.◝◝○?か◆❎⧗⁶-#ᶜ1⁶.~ssssssリ⁸⁶-#ᶜd⁶.▒░░░░😐😐ᶜ²1⁶.aaa¹¹¹\0\0\n⁶. \0\0\0\0\0\0\0⁶.)たたそそき██⁶-#ᶜ1⁶.\0¹³⁷\r\r\r\r⁸⁶-#ᶜ5⁶.   ききき …⁸⁶-#ᶜ6⁶.ららら@@@ら`⁸⁶-#ᶜd⁶.⁙□▮「▮▮▮\0²5ᶜ6⁶.⁶⁶⁶⁶ᵉᵉᵉ゛⁸⁶-#ᶜd⁶.ユユユユナナナら²5ᶜ6⁶.0`\0\0\0\0\0\0⁸⁶-#ᶜa⁶.\0\0\0\0▮▮  ⁸⁶-#ᶜb⁶.\0⁸「0  ▮@⁸⁶-#ᶜd⁶.\0³³⁷⁷⁷⁷ᶠ²5ᶜ6⁶.\0\0\0@██\0\0⁸⁶-#ᶜ9⁶.█\0\0\0\0\0\0\0⁸⁶-#ᶜa⁶.²\0²²²²2 ⁸⁶-#ᶜb⁶.⁴⁶ᶜᶜ、<ᶜ_²5ᶜ6⁶.\0\0\0\0\0\0▒³⁸⁶-#ᶜ7⁶.\0\0\0\0\0¹²░⁸⁶-#ᶜ9⁶.[トめへム|80⁸⁶-#ᶜa⁶.さ DH▮\0\0\0²5ᶜ6⁶.\0\0\0\0\0¹ュ◝⁸⁶-#ᶜ7⁶.\0\0\0\0\0◜³\0⁸⁶-#ᶜ9⁶.⬇️をもS\0\0\0\0⁸⁶-#ᶜa⁶.|9Cて\0\0\0\0²5ᶜ6⁶.\0\0\0\0\0▒🐱A⁸⁶-#ᶜ7⁶.\0\0\0\0\0\0¹²⁸⁶-#ᶜ9⁶.レへ^wz<8「⁸⁶-#ᶜa⁶.\nI!⁸⁴\0\0\0²5ᶜ6⁶.\0\0²¹¹²\0¹⁸⁶-#ᶜ7⁶.\0\0\0\0⁴\0²²⁸⁶-#ᶜa⁶.@```pユヲx⁸⁶-#ᶜb⁶. \0\0\0█\0\0█²5ᶜ6⁶.ヒアスpきらら█⁸⁶-#ᶜ7⁶.\0\0\0\0\0\0\0@⁸⁶-#ᶜb⁶.\0\0\0\0\0▮▮」⁶-#ᶜ5⁶.a>³&ノ\0ュ░⁸⁶-#ᶜ6⁶.\0▒ュセ⁙フ³{⁸⁶-#ᶜ7⁶.█@\0\0⁸「\0\0⁸⁶-#ᶜd⁶.ᵉ\0\0\0\0\0\0\0²1ᶜ5⁶.²²⁶ᶜ  ᵇ⁸ᵇ⁸⁶-#ᶜ6⁶.¹¹¹³⁶⁴⁷⁴⁸⁶-#ᶜd⁶.ュュxp000▮²1⁶.ˇ⬆️ˇˇ‖‖⁵¹⁶.ᶜᶜ⁴\0\0\0\0\0 \n ᶜ5⁶.\0\0\0█████⁶-#ᶜ1⁶.\r³\0\0\0\0▮▮⁸⁶-#ᶜ5⁶.オ,かz⁘ヲ((⁸⁶-#ᶜ6⁶. オ`░⁸⁷んん⁸⁶-#ᶜ7⁶.\0\0\0¹ネ\0\0\0²1ᶜ5⁶.0h✽Fひᵇ⁘T⁸⁶-#ᶜ6⁶.ᶠ▶zみKルヌく⁸⁶-#ᶜ7⁶.\0\0\0\0\0\0¹²⁸⁶-#ᶜd⁶.ら█\0\0\0\0\0\0²1ᶜ5⁶.▮ @A▒▒¹¹⁸⁶-#ᶜa⁶.@ら██\0\0\0\0⁸⁶-#ᶜb⁶.き\0\0\0\0\0\0\0⁸⁶-#ᶜd⁶.ᶠ゜?>~~◜\0²1ᶜ5⁶.🐱⁴⁴⁸8ヨ◜\0⁸⁶-#ᶜa⁶. \0@ニれ⁶\0\0⁸⁶-#ᶜb⁶.]ャめ◀⁴⁸\0\0⁸⁶-#ᶜd⁶.\0\0\0\0\0\0¹\0²5ᶜ6⁶.をノt4ま|あb⁸⁶-#ᶜ7⁶.¹²\0\0\0█d、⁸⁶-#ᶜb⁶.\0\0\0¹\0\0\0\0²5ᶜ6⁶.◝¹\0◜◝\0◝\0⁸⁶-#ᶜ7⁶.\0\0\0\0\0◝\0\0²5ᶜ1⁶.\0\0\0\0\0\0\0█⁸⁶-#ᶜ6⁶.CヤチX7~YH⁸⁶-#ᶜ7⁶.⁴\0\0█\0¹&4²5ᶜ1⁶.\0\0\0\0\0\0\0◝⁸⁶-#ᶜ7⁶.¹¹¹\0\0\0\0\0⁸⁶-#ᶜa⁶.8░░F\"ᶜ\0\0⁸⁶-#ᶜb⁶.ろxx8、\0\0\0⁸⁶-#ᶜd⁶.\0\0\0\0\0\0█\0²5ᶜ1⁶.\0\0\0\0\0\0\0◝⁸⁶-#ᶜ6⁶.@\0\0\0\0\0\0\0⁸⁶-#ᶜ7⁶.█\0\0\0\0\0\0\0⁸⁶-#ᶜa⁶.\0⁸\0\0\0\0\0\0⁸⁶-#ᶜb⁶.゜⁷⁶²¹¹\0\0⁸⁶-#ᶜd⁶.\0\0ナナヲヲュ\0²5ᶜ6⁶.✽Lテアアウモd⁸⁶-#ᶜ7⁶.\0\0\0\0\0\0\0🐱⁸⁶-#ᶜd⁶.\0\0\0¹¹\0\0\0²5ᶜ1⁶.ナナナナナナナ◜⁸⁶-#ᶜ6⁶.⁷²³¹¹\0\0¹⁸⁶-#ᶜ7⁶.\0\0\0\0\0¹¹\0⁸⁶-#ᶜd⁶.▮「「、、、、\0²1   \n ²1ᶜ5⁶.██████\0\0⁸⁶-#ᶜd⁶.\0\0\0\0\0\0\0 ²1ᶜ5⁶.*ち((Dれ\0\0⁸⁶-#ᶜ6⁶.わEんん⬇️\0\0\0⁸⁶-#ᶜd⁶.\0\0\0\0\0\0\0ᶜ²1ᶜ5⁶.T‖%$る³\0\0⁸⁶-#ᶜ6⁶.くヌるれ¹\0\0\0⁸⁶-#ᶜ7⁶.²\0\0\0\0\0\0\0⁸⁶-#ᶜd⁶.\0\0\0\0\0ろュ◜²1ᶜ5⁶.¹¹¹¹\0\0\0\0⁸⁶-#ᶜd⁶.>~◜◜\0⁷?◝²1⁶.\0\0¹⁷\0\0\0¹²1ᶜ5⁶.#、\0\0\0\0\0\0⁸⁶-#ᶜ6⁶.、\0\0\0\0\0\0\0²1ᶜd⁶.\0\0\0\0\0\0らユ²1ᶜ5⁶.D8\0\0\0\0\0\0⁸⁶-#ᶜ6⁶.0\0\0\0\0\0\0\0⁸⁶-#ᶜ7⁶.⁸\0\0\0\0\0\0\0⁸⁶-#ᶜd⁶.\0\0\0\0\0◝◝◝²1ᶜ5⁶.\0\0\0\0\0\0\0█⁸⁶-#ᶜd⁶.\0\0らユ\0?○○²1ᶜ5⁶.\0\0\0█\0\0🅾️ン⁸⁶-#ᶜ6⁶.\0\0\0\0\0\0\0⁶⁸⁶-#ᶜ7⁶.\0\0\0\0██\0\0⁸⁶-#ᶜd⁶.\0\0\0¹\0\0\0\0²5ᶜ6⁶.dv::??0●⁸⁶-#ᶜ7⁶.🐱▒AA@@\0¹²5ᶜ1⁶.█\0\0\0◝\0\0\0⁸⁶-#ᶜ6⁶.\0\0\0\0\0\0\0⁷⁸⁶-#ᶜd⁶.~◜◝◝\0◝ユナ²1⁶.\0\0\0\0\0³³⁷  \n ⁶.ナナ\0◜◜◝◝◝⁶.◝◝\0◝◝◝◝◝⁶.◝◝\0◝◝◝◝◝⁶.◝◝\0◝◝◝◝◝⁶.ᶠ◝\0◝◝◝◝◝⁶.ナ◝\0◝◝◝◝◝⁶.◝◝\0◝◝◝◝◝⁶.◝◝\0◝◝◝◝◝²1ᶜ5⁶.██\0\0████⁸⁶-#ᶜd⁶.○○\0³⁷⁷⁷ᶠ²1ᶜ5⁶.pBEQQH((⁸⁶-#ᶜ6⁶.ᵉ<\n🅾️🅾️♥んん⁸⁶-#ᶜ7⁶.▒▒█\0\0\0\0\0²1ᶜ5⁶.>ムi3のそ($⁸⁶-#ᶜ6⁶.A⁙∧アMGんれ⁸⁶-#ᶜ7⁶.█\0\0\0\0\0\0\0²1ᶜ5⁶.▮▶ᶜ⁸ᵇ\n⁸⁸⁸⁶-#ᶜ6⁶.⁸\0³⁷⁴⁵⁷⁷⁸⁶-#ᶜ7⁶.⁷⁸\0\0\0\0\0\0⁸⁶-#ᶜd⁶.ナナ\0ユユユユユ²1⁶.⁷⁷\0?○○◝◝  \n⁶.\0\0ヲヲヲュュュ⁶.◝\0◝◝◝◝◝◝⁶.◝\0◝◝◝◝◝◝⁶.◝\0◝◝◝◝◝◝⁶.◝\0◝◝◝◝◝◝⁶.◝\0◝◝◝◝◝◝⁶.◝\0◝◝◝◝◝◝⁶.◝\0◝◝◝◝◝◝⁶.◝\0◝◝◝◝◝◝²1ᶜ5⁶.██\0\0\0\0\0\0⁸⁶-#ᶜd⁶.゜\0゜゜◝◝◝◝²1ᶜ5⁶.(-'ら\0\0\0\0⁸⁶-#ᶜ6⁶.⁶\0█\0\0\0\0\0⁸⁶-#ᶜ7⁶.りる@\0\0\0\0\0⁸⁶-#ᶜd⁶.\0\0\0⁶ᶠ◝◝◝²1ᶜ5⁶.$bBCら\0\0\0⁸⁶-#ᶜ6⁶.れ▒▒\0\0\0\0\0⁸⁶-#ᶜ7⁶.\0\0\0█\0\0\0\0⁸⁶-#ᶜd⁶.\0\0⁴⁴ᶠ゜◝◝²1ᶜ5⁶.⁸⁴⁴⁶³\0\0\0⁸⁶-#ᶜ6⁶.⁷³³\0\0\0\0\0⁸⁶-#ᶜ7⁶.\0\0\0¹\0\0\0\0⁸⁶-#ᶜd⁶.ユ\0ヲヲュ◜◝◝²1⁶.◝\0◝◝◝◝◝◝⁶.\0\0○◝◝◝◝◝⁶.\0\0\0\0\0\0\0¹\n⁶.ュュュュ\0◝◝◝⁶.◝◝◝◝\0◝◝◝⁶.◝◝◝◝\0◝◝◝⁶.◝◝◝◝\0◝◝◝⁶.◝◝◝◝\0◝◝◝⁶.◝◝◝◝\0◝◝◝⁶.◝◝◝◝\0◝◝◝⁶.◝◝◝◝\0◝◝◝⁶.◝◝◝◝\0◝◝◝⁶.◝◝◝◝\0◝◝◝⁶.◝◝◝◝\0◝◝◝⁶.◝◝◝◝\0◝◝◝⁶.◝◝◝◝\0◝◝◝⁶.◝◝◝◝\0◝◝◝⁶.◝◝◝◝\0◝◝◝⁶.¹¹¹¹\0??○\n²d               ᶜ1⁶.████\0\0\0\0"
titlegfx="⁶-b⁶x8⁶y8 ᶜ7⁶.\0\0\0\0\0ナヲュ⁶.\0\0\0\0>◝ャ█⁶.\0\0\0\0\0³ᶠ゜⁶.\0\0\0\0\0\0\0⁶⁶.\0\0\0\0\0\0らら⁶.\0\0\0\0█ナニリ⁶.\0\0\0ム◝◝⁷³⁶.▮ᶜ\0³³¹\0\0  ⁶.\0\0\0\0\0\0\0⁶⁶.\0\0\0\0█`ナ█⁶.\0\0\0\0 1゜⁷ \n⁶.\0\0⁵\0000xp\0⁶.ュヲユ█\0\0\0⁶⁶.\0\0³⁷゛pナナ⁶.゛\0██ららりニ⁶.ᶠ911qqニ◝⁶.り♥◆゛、、<9⁶.リGんんを●ᵉᵉ⁶.\0>゜¹¹ネ◝◜⁶.\0\0\0\0ᵉ゜ᶠ³⁶.\0\0\0らユx、😐⁶.\0\0█ら@@¹¹⁶. `\0██\0\0\0⁶.\0\0\0¹³⁷⁶ᶜ⁶.ᶠ^\0\0\0\0\0\0⁶.\0\0\0²\0⁴⁸⁸\n⁶.\0\0\0\0\0\0\0ユ⁶.◝◝◝◜ヲ█\0³⁶.ナ◝◝◝◝◝\0\0⁶.れネネネニナ█\0⁶.◝れ⬇️⬇️⬇️³¹\0⁶.qヨヨ¹\0\0\0ら⁶.⁷³\0\0\0`ナナ⁶.\0\0\0をウウアア⁶.\0````ナナら⁶.アュ8pナ█\0「⁶.▮「「ᶜ⁶³\0\0 ⁶.`ナら██\0\0\0⁶.\0\0¹³フp\0\0⁶.\0ᶜ⁶\0\0\0\0\0\n⁶.ヲヲx88>>~⁶.?◝ュナら\0█ム⁶.\0りネネネネリヨ⁶.\0\0らユヲx||⁶.\0\0▒トトテチら⁶.らら◆゜。89q⁶.りんエテうままp⁶.ツセ▥▥▥▥い³⁶.り▒¹¹りリ◝゜⁶.。ᶠ\0\0\0\0\0\0     \n⁶.◜◜テ゜ᶠᶠᶠᶠ⁶.◝◝◝\0\0\0\0\0⁶.ヨヨユヲxxpユ⁶.<<<<<|ヲユ⁶.らら███\0=?⁶.ヨニりニフg~<⁶.pナナ\0\0\0\0\0⁶.³³³\0\0\0\0\0       \n⁶.゛゛ᵉ08⁸@\0 ⁶.ユユユ\0\0\0\0\0⁶.ナら\0\0\0\0\0\0⁶.??゜\0\0\0\0\0          \n"

--ensure min speeds, pos or neg
function minspeed(spd,minspd)
  if (abs(spd)~=0 and abs(spd)<minspd) then
    if spd<0 then spd=-minspd else spd=minspd end
  end
  return spd
end

--zero pad a number
function pad(string,length)
  string=""..string
  if (#string==length) return string
  return "0"..pad(string,length-1)
end

--center text with optional bg color
function centertxt(str,y,clr,bg)
  if (bg) rectfill(64-(#str*2)-2,y-1,64+(#str*2),y+5,bg)
  print(str,64-#str*2,y,clr)
end

--text with bg
function bgtxt(str,x,y,clr,bg)
  rectfill(x-2,y-1,x+#str*4,y+5,bg)
  print(str,x,y,clr)
end

--get map sprite at a pixel location
function getmapsprite(x,y)
  local mx=flr(x/8)
  local my=flr(y/8)
  local map_sprite=mget(mx,my)
  return map_sprite
end

--check if object offstage
function is_offstage(obj,offset)
  offset=offset or 0
  return obj.x<0-offset or obj.x>128+offset or obj.x<0-offset or obj.y>128+offset
end

--ye olde screen rattle
function screen_shake()
  local offset_x=1-rnd(2)
  local offset_y=1-rnd(2)
  camera(offset_x,offset_y)
end

function _init()
  cartdata("savepicoville") --persistent hiscore
  t=0
  level=1
  hiscore=dget(0) or 0
  enemieskilled=0
  titleshadowclr={13,14,9,14,13}
  enemyspeed=1
  mode="title"
  peopleleft=100
  bonuscheck={x=0,y=15}
  bonuslastbrick=nil
  empty_stage()
  make_player()
  music(0,2500)
end

function game_over()
  t=0
  hiscore=max(hiscore,p.score)
  dset(0,hiscore) --record hiscore in cartdata
  level=1
  p.respawn()
  sfx(04)
  mode="game over"
end

--stats on top of screen
function status_bar()
  rectfill(0,0,128,8,1)
  --blink fuel if low (and game isn't over)
  print("fuel:"..flr(p.fuel),4,2,(mode=="game" and t%40<20 and p.fuel<p.lowfuel and 7 or 9))
  print("score:"..p.score.."0",48,2,9)
  for i=1,p.life do
    spr(56,124-i*6,0)
  end
end

function check_level()
  --currently super basic difficulty ramp based on original game
  if ((level==1 and enemieskilled>=10) or enemieskilled>=16) then
    level_finished()
  end
end

function level_finished()
  t=0
  enemieskilled=0
  enemyspeed=level
  bullets={}
  mode="bonus"
  -- set min/max starting points for bonuscheck
  for building in all(buildings) do
    bonuscheck.y = min(bonuscheck.y,14-building.height)
    bonuscheck.x = max(bonuscheck.x,building.x+building.width)
  end
end

function next_level()
  t=0
  level+=1
  enemies={}
  gremlins={}
  supply={}
  balloon={}
  p.respawn()
  mode="game"
end

function start_game()
  empty_stage()
  music(-1)
  sfx(05)
  mode="game"
end

--clear out stage actors
function empty_stage()
  enemies={}
  gremlins={}
  supply={}
  balloon={}
  bullets={}
  trains={}
  explosions={}
  buildingcrash={}
  rumblingrows={}
  local maxheight=(mode=="title" and 3 or nil)
  make_buildings(maxheight)
end

function restart()
  t=0
  enemieskilled=0
  p.reset()
  mode="title"
  empty_stage()
  music(0,2500)
end

function _update()
  t+=1
  building_update()

  if mode=="title" then

    building_blink(4)
    check_enemy_spawn(5)
    check_train_spawn()
    for grp in all({enemies,gremlins,rumblingrows,trains}) do
      for obj in all(grp) do
        obj:update()
      end
    end
    -- enough time has elapsed and btn is pressed
    if t>5 and btn(4) then
      start_game()
    end

  elseif mode=="bonus" then

    for grp in all({explosions,rumblingrows,trains}) do
      for obj in all(grp) do
        obj:update()
      end
    end
    -- set last bonus brick that flashed white to dark
    if bonuslastbrick~=nil then
      mset(bonuslastbrick.x,bonuslastbrick.y,05)
      bonuslastbrick=nil
    end
    -- tally bonus points
    if (bonuscheck.y<16) then
      local map_sprite=mget(bonuscheck.x,bonuscheck.y)
      -- skip tiles until brick
      while map_sprite>5 and bonuscheck.y<16 do
        bonuscheck.x-=1
        if bonuscheck.x<0 then
          bonuscheck.y+=1
          bonuscheck.x=15
        end
        map_sprite=mget(bonuscheck.x,bonuscheck.y)
      end
      -- unbroken brick
      p.scored(1)
      bonuslastbrick={x=bonuscheck.x,y=bonuscheck.y}
      sfx(12)
      mset(bonuscheck.x,bonuscheck.y,map_sprite+47) --white flash
      bonuscheck.x-=1
      if bonuscheck.x<0 then
        bonuscheck.y+=1
        bonuscheck.x=15
      end
    else
      building_blink(1)
      if (t>10 and btnp(4)) then
        next_level()
      end
    end

  elseif mode=="game" then

    p.update()
    building_blink(3)
    check_enemy_spawn(level+1)
    check_supply_spawn()
    check_train_spawn()
    for grp in all({bullets,enemies,gremlins,supply,balloon,explosions,rumblingrows,trains}) do
      for obj in all(grp) do
        obj:update()
      end
    end

  elseif mode=="game over" then

    building_blink(1)
    for grp in all({enemies,gremlins,supply,balloon,explosions,rumblingrows,trains}) do
      for obj in all(grp) do
        obj:update()
      end
    end
    if (t>10 and btnp(4)) then
      restart()
    end

  end
end

-- draw!
function _draw()
  cls()
  --draw the stage including generated buildings
  map(0,0,0,0,128,32)

  if mode=="title" then

    for grp in all({enemies,gremlins,rumblingrows,trains}) do
      for obj in all(grp) do
        obj:draw()
      end
    end
    rectfill(0,0,128,8,1)
    centertxt("clixel presents",2,12)
    if (t%6==0) then
      -- rotate shadow colors
      local foo=deli(titleshadowclr,1)
      add(titleshadowclr,foo)
    end
    pal(13,titleshadowclr[1])
    spr(64,19,24,12,1)
    pal(13,titleshadowclr[2])
    spr(64,19,23,12,1)
    pal(13,10)
    spr(64,19,22,12,1)
    pal()
    centertxt("🅾️ start game",42,1)
    centertxt("hi-score:"..pad(hiscore.."0",6),113,1,2)
    centertxt("hi-score:"..pad(hiscore.."0",6),114,9)

  elseif mode=="game" then

    for grp in all({bullets,enemies,gremlins,supply,balloon,explosions,rumblingrows,trains}) do
      for obj in all(grp) do
        obj:draw()
      end
    end
    p.draw()
    status_bar()

  elseif mode=="bonus" then

    for grp in all({explosions,rumblingrows,trains}) do
      for obj in all(grp) do
        obj:draw()
      end
    end
    status_bar()
    print("level "..level.." complete",32,28,1)
    if bonuscheck.y<16 and t%30<15 then
      print("bonus points",40,38,1)
    end

  elseif mode=="game over" then

    for grp in all({enemies,gremlins,supply,balloon,explosions,rumblingrows,trains}) do
      for obj in all(grp) do
        obj:draw()
      end
    end
    rectfill(0,0,128,8,1)
    centertxt("score:"..p.score.."0",2,9)
    centertxt("game over",28,1)
    centertxt("restart",38,7,1)
  end

end
